# 누락된 데이터 처리하기

In [2]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
# pandas 객체의 모든 기술 통계는 누락된 데이터를 배제하고 처리한다. 
string_data=pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data # pandas는 누락된 데이터를 실숫값인 Nan으로 취급, 이는 누락된 값을 쉽게 찾을 수 있도록 하는 파수병 역할

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0]=None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

* 누락된 데이터 골라내기

In [7]:
from numpy import nan as NA

In [9]:
# Series 객체일 경우

data=pd.Series([1,NA,3.5,NA,7])
data.dropna() # Series에 dropna 메서드를 적용하면 널이 아닌 데이터와 색인값만 들어있는 Series 반환

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()] # 위 코드와 동일

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
# DataFrame 객체일 경우

data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned=data.dropna() # dopna는 기본적으로 NA값을 하나라도 포함하고 있는 로우를 제외
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all') # how='all' 옵션을 넘기면 모두 NA값인 로우만 제외

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
#DataFrame의 로우를 제외: 시계열 데이터에 주로 사용됨

data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1,how='all') # axis=1 옵션을 넘겨주어 컬럼을 제외

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df=pd.DataFrame(np.random.randn(7,3))

In [21]:
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  1.636193       NaN       NaN
1 -0.854827       NaN       NaN
2  0.338756       NaN  0.592510
3 -0.826462       NaN -0.553135
4 -0.279642 -1.701218 -0.125285
5  0.546942  0.858800 -0.060851
6 -0.749225 -1.828624 -0.953037

In [22]:
df.dropna()

          0         1         2
4 -0.279642 -1.701218 -0.125285
5  0.546942  0.858800 -0.060851
6 -0.749225 -1.828624 -0.953037

In [25]:
df.dropna(thresh=2) # tresh 인자에 원하는 값을 넘기면 몇 개 이상의 값이 들어 있는 로우만 살펴볼 수 있음

          0         1         2
2  0.338756       NaN  0.592510
3 -0.826462       NaN -0.553135
4 -0.279642 -1.701218 -0.125285
5  0.546942  0.858800 -0.060851
6 -0.749225 -1.828624 -0.953037

* 결측치 채우기

In [26]:
df.fillna(0) # fillna 메서드로 결측치를 채워준다.

          0         1         2
0  1.636193  0.000000  0.000000
1 -0.854827  0.000000  0.000000
2  0.338756  0.000000  0.592510
3 -0.826462  0.000000 -0.553135
4 -0.279642 -1.701218 -0.125285
5  0.546942  0.858800 -0.060851
6 -0.749225 -1.828624 -0.953037

In [28]:
df.fillna({1:0.5, 2:0}) # 사전값을 넘겨서 각 컬럼마다 다른 값을 채울 수도 있다.

          0         1         2
0  1.636193  0.500000  0.000000
1 -0.854827  0.500000  0.000000
2  0.338756  0.500000  0.592510
3 -0.826462  0.500000 -0.553135
4 -0.279642 -1.701218 -0.125285
5  0.546942  0.858800 -0.060851
6 -0.749225 -1.828624 -0.953037

In [35]:
_=df.fillna(0,inplace=True) #fillna는 새로운 객체를 반환하지만 기존 객체를 변경할 수도 있다.
df

          0         1         2
0  1.636193  0.000000  0.000000
1 -0.854827  0.000000  0.000000
2  0.338756  0.000000  0.592510
3 -0.826462  0.000000 -0.553135
4 -0.279642 -1.701218 -0.125285
5  0.546942  0.858800 -0.060851
6 -0.749225 -1.828624 -0.953037

In [36]:
df=pd.DataFrame(np.random.randn(6,3))

In [37]:
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0 -1.074687  2.015106  1.325679
1  0.336788 -0.129420 -0.395593
2 -0.466254       NaN  0.862366
3  0.336366       NaN -0.031550
4 -0.926234       NaN       NaN
5 -1.114808       NaN       NaN

In [38]:
df.fillna(method='ffill') # 재색인에서 사용 가능한 보간 메서드는 fillna메서드에서도 사용 가능

          0         1         2
0 -1.074687  2.015106  1.325679
1  0.336788 -0.129420 -0.395593
2 -0.466254 -0.129420  0.862366
3  0.336366 -0.129420 -0.031550
4 -0.926234 -0.129420 -0.031550
5 -1.114808 -0.129420 -0.031550

In [39]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -1.074687  2.015106  1.325679
1  0.336788 -0.129420 -0.395593
2 -0.466254 -0.129420  0.862366
3  0.336366 -0.129420 -0.031550
4 -0.926234       NaN -0.031550
5 -1.114808       NaN -0.031550

In [40]:
data=pd.Series([1.,NA,3.5,NA,7]) 
data.fillna(data.mean()) # Series의 평균값이나 중간값을 전달할 수 도있음.

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 데이터 변형

* 중복 제거하기

In [41]:
data=pd.DataFrame({'k1':['one', 'two']*3+['two'],
                 'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [42]:
data.duplicated() # duplicated메서드는 각 로우가 중복인지 아닌지 알려주는 불리언 Series반환

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [43]:
data.drop_duplicates() # drop_duplicates는 duplicated 배열이 False인 DataFrame을 반환

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [47]:
# duplicated와 drop_duplicates는 모든 컬럼에 적용되며 중복을 찾아내기 위한 부분합을 따로 지정 가능
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [48]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [46]:
data.drop_duplicates(['k1','k2']) # duplicated와 drop_duplicates는 기본적으로 처음 발견된 값을 유지

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [45]:
data.drop_duplicates(['k1','k2'],keep='last') # keep='last' 옵션을 넘기면 마지막으로 발견된 값을 반환

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

* 함수나 매핑을 이용해서 데이터 변형하기

In [50]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
                  'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [51]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'cow',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
} # 육류별 동물을 담고 있는 사전 데이터

In [53]:
lowercased = data['food'].str.lower() # str.lower메서드를 사용해서 모두 소문자로 변경
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [54]:
data['animal']=lowercased.map(meat_to_animal) # 컬럼 추가
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     cow
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [55]:
data['food'].map(lambda x : meat_to_animal[x.lower()]) # 함수를 사용하여 적용시키기

0       pig
1       cow
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

* 값 치환하기

In [57]:
# replace 메서드는 한 객체 안의 값의 부분집합을 변경하는데에 map 메서드보다 더 간단한 방법 제공

data=pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [58]:
# -999는 누락된 데이터를 나타내기 위한 값
data.replace(-999,np.nan) # replace메서드를 이용하여 -999를 pandas에서 인식하는 NA값으로 치환한 새로운 Series생성(inplace=True])

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace([-999,-1000],np.nan) # 여러개의 값을 한 번에 치환하려면 하나의 값 대신 치환하려는 값의 리스트를 넘기기

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [61]:
data.replace([-999,-1000],[np.nan,0]) # 치환하려는 값마다 다른 값으로 치환하는 경우

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data.replace({-999:np.nan,-1000:0}) # 두 개의 리스트 대신 사전을 이용하는 것도 가능하다.

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

* 축 색인 이름 바꾸기

In [65]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                 index=['Ohio','Colorado','New York'],
                 columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [67]:
transform=lambda x:x[:4].upper() 
data.index.map(transform) # map메서드를 사용하여 색인을 대문자로 바꾸기

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [68]:
data.index=data.index.map(transform) # 대문자로 변경된 축 이름을 바로 대입하기
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [69]:
data.rename(index=str.title, columns=str.upper) # rename 메서드를 통해 기존 객체를 변경하지 않고 새로운 객체를 생성

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [71]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'}) # rename 메서드는 사전 형식의 객체를 이용하여 일부 축 이름 변경 가능

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [72]:
data.rename(index={'OHIO':'INDIANA'},inplace=True) # rename 메서드를 사용하면 바로 변경 가능, 원본데이터 변경시 inplace=True
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

* 개별화와 양자화

In [73]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [74]:
bins=[18,25,35,60,100]

In [75]:
cats=pd.cut(ages,bins) # pandas의 cut함수를 이용하여 18-25,26-35,36-60,60-그룹으로 나눈다
cats #이 객체는 그룹 이름이 담긴 배열

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [76]:
# Categorical객체는 codes속성에 있는 ages데이터에 대한 이름을 Categories라는 배열에 담고있다.
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [77]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [78]:
pd.value_counts(cats) # pandas.cut 결과에 대한 그룹 수

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [79]:
# 간격을 나타내는 표기법: (0,10]-> 0은 포함하지 않고 10은 포함
pd.cut(ages, [18,26,36,61,100], right=False) # right=False을 넘겨 중괄호 대신 대괄호 쪽이 포함되지 않도록 바꿈

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [80]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names) # labels옵션으로 그룹의 이름을 직접 넘겨줄 수도 있다.

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [81]:
# cut함수에 그룹의 경곗값을 넘기지 않고 그룹의 개수를 넘기면 데이터에서 최소,최댓값을 기준으로 균등한 길이의 그룹을 자동으로 계산
data=np.random.randn(20)
pd.cut(data,4,precision=2) # precision=2 옵션은 소수점 아래 2자리까지로 제한한다.

[(1.07, 1.91], (0.23, 1.07], (-1.46, -0.62], (-1.46, -0.62], (-0.62, 0.23], ..., (-1.46, -0.62], (0.23, 1.07], (-0.62, 0.23], (0.23, 1.07], (-1.46, -0.62]]
Length: 20
Categories (4, interval[float64]): [(-1.46, -0.62] < (-0.62, 0.23] < (0.23, 1.07] < (1.07, 1.91]]

In [82]:
data=np.random.randn(1000) # 정규분포

In [84]:
cats=pd.qcut(data,4) # qcut 메서드로 4분위로 분류
cats

[(0.677, 3.132], (-0.655, -0.0171], (-3.274, -0.655], (0.677, 3.132], (0.677, 3.132], ..., (-3.274, -0.655], (-3.274, -0.655], (0.677, 3.132], (-3.274, -0.655], (-3.274, -0.655]]
Length: 1000
Categories (4, interval[float64]): [(-3.274, -0.655] < (-0.655, -0.0171] < (-0.0171, 0.677] < (0.677, 3.132]]

In [85]:
pd.value_counts(cats)

(0.677, 3.132]       250
(-0.0171, 0.677]     250
(-0.655, -0.0171]    250
(-3.274, -0.655]     250
dtype: int64

In [86]:
pd.qcut(data,[0,0.1,0.5,0.9,1.]) # qcut함수는 cut함수와 유사하게 변위치를 직접 지정 가능: 변위치 0~1

[(-0.0171, 1.234], (-1.269, -0.0171], (-1.269, -0.0171], (1.234, 3.132], (1.234, 3.132], ..., (-1.269, -0.0171], (-1.269, -0.0171], (1.234, 3.132], (-1.269, -0.0171], (-1.269, -0.0171]]
Length: 1000
Categories (4, interval[float64]): [(-3.274, -1.269] < (-1.269, -0.0171] < (-0.0171, 1.234] < (1.234, 3.132]]

* 특잇값을 찾고 제외하기

In [90]:
data=pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.002314     0.022061     0.009613    -0.021832
std       0.974309     1.002816     0.951804     1.000101
min      -3.060916    -3.119422    -2.898545    -3.382826
25%      -0.676181    -0.708352    -0.610621    -0.727966
50%      -0.018780     0.028803    -0.003721     0.036714
75%       0.627145     0.712546     0.668140     0.647943
max       3.043685     3.365244     3.172702     2.963436

In [91]:
# 절댓값이 3을 초과하는 값 찾아내기
col=data[2]
col[np.abs(col)>3]

448    3.172702
Name: 2, dtype: float64

In [92]:
# DataFrame에서 any메서드를 사용하여 절댓값이 3을 초과하는 값이 들어 있는 모든 로우를 선택
data[(np.abs(data)>3).any(1)]

            0         1         2         3
27  -3.060916 -0.662844  0.377529 -1.215589
127 -0.050036  3.365244 -1.012202  0.072309
163  1.323716 -3.056938  0.230368  0.177270
200  3.043685  1.850828 -0.001964 -0.934198
285 -3.058198  1.100270  0.667954 -0.058317
387 -0.313908  3.190510  0.348080 -0.205829
431 -0.541711  0.632143 -1.667061 -3.382826
448  1.650212 -0.783224  3.172702 -1.295546
619  1.256211 -3.119422  1.014118 -0.319155

In [93]:
# -3이나 3을 초과하는 값을 -3이나 3으로 지정
data[np.abs(data)>3]=np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.002390     0.021681     0.009440    -0.021449
std       0.973802     1.000535     0.951245     0.998886
min      -3.000000    -3.000000    -2.898545    -3.000000
25%      -0.676181    -0.708352    -0.610621    -0.727966
50%      -0.018780     0.028803    -0.003721     0.036714
75%       0.627145     0.712546     0.668140     0.647943
max       3.000000     3.000000     3.000000     2.963436

In [94]:
np.sign(data).head() # np.sign(data)는 data값이 양수인지 음수인지에 따라 1이나 -1이 담긴 배열 반환

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1  1.0 -1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3  1.0 -1.0 -1.0  1.0
4  1.0 -1.0  1.0 -1.0

* 치환과 임의 샘플링

In [95]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler=np.random.permutation(5) # numpy.random.permutation를 사용하여 로우를 쉽게 임의 순서로 재배치할 수 있다.
sampler # 이 배열은 iloc기반의 색인이나 take함수에서 사용 가능

array([4, 2, 3, 1, 0])

In [96]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [97]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3

In [98]:
df.sample(n=3) # sample 메서드를 사용하여 치환없이 일부만 임의로 선택

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7

In [99]:
choices=pd.Series([5,7,-1,6,4])
draws=choices.sample(n=10,replace=True) # sample에 replace=True 옵션을 넘겨 표본을 치환을 통해 생성
draws

2   -1
4    4
0    5
4    4
1    7
1    7
1    7
0    5
4    4
0    5
dtype: int64

* 표시자/더미 변수 계산
  : 통계 모델이나 머신러닝 애플리케이션을 위한 또 다른 데이터 변환은 분류값을 '더미'나 '표시자' 행렬로 전환하는 것

In [100]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],
                'data1':range(6)})

In [101]:
pd.get_dummies(df['key']) # get_dummies함수

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [104]:
# prefix 인자를 사용하여 DF 안에 있는 컬럼에 접두어를 추가한 후 다른 데이터와 병합

dummies=pd.get_dummies(df['key'],prefix='key')
df_with_dummy=df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [106]:
mnames=['movie_id','title','genres']

In [108]:
movies=pd.read_table('datasets/movielens/movies.dat',sep='::',header=None, names=mnames)

In [109]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [110]:
# 각 장르마다 표시자 값을 추가하려면?

all_genres=[]

In [111]:
for x in movies.genres:
    all_genres.extend(x.split('|')) 
genres=pd.unique(all_genres) # 데이터 묶음에서 유일한 장르목록 추출

In [112]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [113]:
zero_matrix=np.zeros((len(movies), len(genres))) # DataFrame을 만들기 위해 0으로 초기화된 DataFrame생성

In [116]:
dummies=pd.DataFrame(zero_matrix,columns=genres)

In [117]:
gen=movies.genres[0]

In [118]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [119]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [122]:
for i, gen in enumerate(movies.genres):
    indices=dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices]=1 # iloc을 이용하여 색인에 맞게 대입

In [124]:
movies_windic = movies.join(dummies.add_prefix('Genres_')) # movies와 조합
movies_windic.iloc[0]

movie_id                                        1
title                            Toy Story (1995)
genres                Animation|Children's|Comedy
Genres_Animation                                1
Genres_Children's                               1
Genres_Comedy                                   1
Genres_Adventure                                0
Genres_Fantasy                                  0
Genres_Romance                                  0
Genres_Drama                                    0
Genres_Action                                   0
Genres_Crime                                    0
Genres_Thriller                                 0
Genres_Horror                                   0
Genres_Sci-Fi                                   0
Genres_Documentary                              0
Genres_War                                      0
Genres_Musical                                  0
Genres_Mystery                                  0
Genres_Film-Noir                                0
Genres_Western                                  0
Name: 0, dtype: object

In [125]:
# get_dummies와 cut같은 이산함수를 잘 조합하면 통계 애플리케이션에서 유용하게 쓰임

np.random.seed(12345) # numpy.random.see 함수를 이용해 난수 시드값을 지정하여 예제 값이 불변하도록 함

In [126]:
values=np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [127]:
bins=[0,0.2,0.4,0.6,0.8,1]

In [128]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 문자열 다루기

* 문자열 객체 메서드

In [129]:
val='a,b, guido' 
val.split(',') # split메서드를 이용하여 쉽표로 구분된 문자열을 분리

['a', 'b', ' guido']

In [130]:
pieces=[x.strip() for x in val.split(',')] # split메서드는 strip메서드(공백문자제거)와 조합해서 사용
pieces

['a', 'b', 'guido']

In [131]:
first,second,third=pieces

In [132]:
first+'::'+second+'::'+third # 더하기 연산을 통해 합칠 수도 있다.

'a::b::guido'

In [133]:
'::'.join(pieces) # join메서드를 이용하는 것이 더 파이썬스러운 방법

'a::b::guido'

In [134]:
'guido' in val # in예약어를 사용하면 일치하는 부분문자열을 쉽게 찾을 수 있다.

True

In [135]:
val.index(',') # index는 find와 달리 문자열을 찾지 못하면 예외를 발생시킴

1

In [136]:
val.find(':') # find는 문자열을 찾지 못하면 -1를 반환

-1

In [137]:
val.count(',') # count는 특정 부분문자열이 몇 건 발견되었는지 반환

2

In [138]:
val.replace(',','::') # replace는 찾아낸 패턴을 다른 문자열로 치환

'a::b:: guido'

* 정규 표현식: 텍스트에서 문자열 패턴을 찾는 유연한 방법 제공

In [139]:
import re # re 모듈 함수는 패턴 매칭, 치환, 분리 세가지로 나뉨

In [140]:
text="foo bar\t baz \tqux"

In [141]:
# \s+는 하나 이상의 공백 문자를 의미하며 이를 사용해 문자열을 분리
    
re.split('\s+',text) # 먼저 정규 표현식이 컴파일되고 그 후 split메서드가 실행

['foo', 'bar', 'baz', 'qux']

In [143]:
regex=re.compile('\s+') # compile로 직접 정규 표현식을 컴파일하고 얻은 정규 표현식 객체를 재사용하는 것도 가능

In [144]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [145]:
regex.findall(text) # findall 메서드로 정규 표현식에 매칭되는 모든 패턴의 목록을 얻을 수 있음

[' ', '\t ', ' \t']

In [153]:
text="""Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [155]:
pattern=r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [156]:
regex=re.compile(pattern, flags=re.IGNORECASE) # re.IGNORECASE는 정규 표현식이 대소문자를 가리지 않음

In [157]:
regex.findall(text) # findall 메서드를 사용해서 이메일 주소의 리스트를 생성

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [158]:
m=regex.search(text) # search는 텍스트에서 첫 번째 이메일 주소만을 찾아줌
m # match 객체는 그 정규 표현 패턴이 문자열 내에서 위치하는 시작점과 끝점만을 알려준다.

In [159]:
text[m.start():m.end()]

'dave@google.com'

In [160]:
print(regex.match(text)) # regex.match는 None을 반환, 그 정규 표현 패턴이 문자열의 시작점에서부터 일치하는지 검사하기 때문

None

In [161]:
print(regex.sub('REDACTED',text)) # sub메서드는 찾은 패턴을 주어진 문자열로 치환하여 새로운 문자열을 반환

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [162]:
# 이메일 주소를 찾아서 동시에 각 이메일 주소를 사용자 이름, 도메인 이름, 도메인 접미사로 나눠야 한다면

pattern=r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})' # 각 패턴을 괄호로 묶어준다

In [164]:
regex=re.compile(pattern, flags=re.IGNORECASE)

In [165]:
m = regex.match('wesm@bright.net') # match 객체를 이용하면 groups 메서드로 각 패턴 컴포넌트의 튜플을 얻을 수 있음

In [166]:
m.groups()

('wesm', 'bright', 'net')

In [167]:
regex.findall(text) # 패턴의 그룹이 존재한다면 findall메서드는 튜플의 목록을 반환

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [168]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

* pandas의 벡터화된 문자열 함수

In [170]:
data={'Dave':'dave@google.com', 'Steve':'steve@gmail.com', 'Rob':'rob@gmail.com','Wes':np.nan}
data=pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [171]:
data.isnull() # 문자열과 정규 표현식 메서드는 data.map을 사용하여 각 값에 적용할 수 있지만 NA값을 만나면 실패함.

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [173]:
# 이러한 문제를 해결하기 위해 간결한 문자열 처리 메서드 존재

data.str.contains('gmail') # str.contains은 각 이메일 주소가 'gmail'을 포함하고 있는지 검사

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [174]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [175]:
data.str.findall(pattern, flags=re.IGNORECASE) # 정규 표현식을 IGNORECASE와 같은 re옵션과 함께 사용 가능

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [177]:
matches=data.str.match(pattern, flags=re.IGNORECASE) # str.get 또는 str속성의 색인을 이용하여 벡터화된 요소를 꺼내옴
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [191]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!